# Pandas Exercises

## Setup and Importing

### 1. Import Libraries

Before you begin you should import the two main data manipulation libraries for Python.

Note: Be sure to use their common aliases

In [1]:
import numpy as np
import pandas as pd

### 2. Importing from different sources

In the following blocks you will create a pandas dataframe and you will save that dataframe to a variable named ```df```. After each import, you should use another Pandas function to view your dataframe to ensure that it was imported correctly.

#### Import and view from CSV

In [2]:
df = pd.read_csv("C:/ddimil/lessons/Pandas/data/payers.csv")
df.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43

#### Import and view from Excel

In [3]:
df = pd.read_excel("C:/ddimil/lessons/Pandas/data/payers.xlsx")
df.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.840,2015-12-22 21:19:23.417,NaT,NaN,0,Card,NaN
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205,NaT,NaT,NaN,0,Card,NaN
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.949,2016-01-05 22:54:01.211,NaT,NaN,0,Card,NaN
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.954,2016-01-14 19:05:16.639,NaT,NaN,0,Card,NaN
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.846,2016-01-26 23:25:43.269,NaT,NaN,0,Card,NaN

#### Import and view from JSON

In [4]:
df = pd.read_json("C:/ddimil/lessons/Pandas/data/payers.json")
df.head()

,address,bill_day,company_name,created_at,deleted_at,email,id,intacct_id,name,notes,source,updated_at
0,None,0,Weissnat Group,2015-12-21 17:00:25.839697,NaT,constantin@example.net,1038,None,Parisian,NaN,Card,2015-12-22 21:19:23.416702
1,None,0,Bogisich and Bogisich Group,2016-02-12 00:52:30.205216,NaT,susana@example.org,1178,None,Cormier,NaN,Card,NaT
2,None,0,Schultz and Hane and Sons,2015-07-01 22:19:34.948958,NaT,bailey@example.org,45,None,Hilpert,NaN,Card,2016-01-05 22:54:01.211366
3,None,0,Lowe and Raynor Group,2016-01-13 20:00:45.953792,NaT,torey@example.com,1084,None,Olson,NaN,Card,2016-01-14 19:05:16.638872
4,None,0,Dooley and Schumm Group,2016-01-12 20:22:40.846050,NaT,felicia@example.org,1077,None,Pfannerstill,NaN,Card,2016-01-26 23:25:43.269280

### 3. Different ways to preview dataset

There are three main methods in python to get a quick preview of your dataset. One method views the top rows, another method views the bottom rows, and the final method views a random sample of rows. Please re-import the CSV file as ```df``` and demonstrate all three methods.

#### View top rows

#### View bottom rows

#### View random rows

How would you change the number or rows that are being viewed in each of these methods? Below, view a random sample of 20 rows.

#### View 10 random rows

#### View 20 random rows

#### View the number or rows and columns in your dataset

#### Get basic info about your dataset

### 3. Simple selecting from a DataFrame

Once you have properly imported your data and you are going to start selecting and transforming it, you should create a copy so you can refer to your untransformed data later.

Note: It can sometimes

#### Create a copy of your original dataframe called df_copy

Remember that you can use both **.loc** and **.iloc** to access either rows or columns in a dataframe.

#### Select the 50th row in df_copy

Remember: Python and Pandas both start counting at 0, so the very first row is row index 0. The tenth row is at row index 9. For example ```df_copy.loc[0:9]``` will return 10 rows and ```df_copy.loc[0:10]``` will return 11 rows.

#### Select the 50th row index in df_copy

#### Select the row index 100 - 110

#### Select the row index for rows 35, 55, 75, and 95

#### Select only the "email" column from the dataframe

#### Select column "id" through column "name"

#### Select all rows from the columns "email", "name", and "bill_amt"

#### Select row indexes 10, 15, 21, and 71 with only the columns "id", "name",  and "source"

### 4. Conditional selection

#### Create a boolean mask for "bill_amt" less than 35000

#### Use boolean mask to get those rows which have "bill_amt" less than 3500

#### Find rows with the column "name" equal to "Price"

#### Find rows where the "update_at" column is before 2018

#### Select the rows where the "name" column is "Hackett" and the "bill_amt" is greater than 25000

### 5. Transforming a DataFrame

Note: After transforming a DataFrame it is good practice to display the transformed DataFrame to ensure that the expected changes were made. This can be done by viewing the top rows of the DataFrame or by checking specific rows that you are concerned with.

#### View the top rows before making any changes

#### Drop the "address" column from your DataFrame and check your results

#### Drop all columns with Nan values

#### Create a new column named "original_account" filled with the value "yes"

#### Add 10000 to the "bill_amt" for all rows

### 6. Save you DataFrame to a new CSV file in your data folder called "clean_payers.csv"

#### Check that "clean_payers.csv" was properly saved to your computer